/*
題目描述(並使用遞迴)
有一頭母牛，它每年年初生一頭小母牛。每頭小母牛從第四個年頭開始，每年年初也生一頭小母牛。
請編程實現在第n年的時候，共有多少頭母牛？

輸入
輸入數據由多個測試實例組成，每個測試實例佔一行，包括一個整數n(0<n<55)，n的含義如題目中描述。
n=0表示輸入數據的結束，不做處理。

輸出
對於每個測試實例，輸出在第n年的時候母牛的數量。
每個輸出佔一行。

樣例輸入
2,4,5,0
樣例輸出
2,4,6,
///////////////////////////////////////////////////////////////////////////////
思路:
宣告一個陣列如下
cow---母牛---三歲的牛---二歲的牛--一歲的牛

*/
#include<iostream>
using namespace std;
int brith(int,int*);
int main (){
    int cows[4];


}
int brith(int formove,int *lenth){
    if(lenth==0)
    else return brith()
}
